In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Datos/nombres.csv')

In [3]:
df

        state sex  year     name  quantity
0          MO   F  1910     Mary       611
1          MO   F  1910    Helen       313
2          MO   F  1910  Dorothy       270
3          MO   F  1910  Mildred       267
4          MO   F  1910     Ruth       237
...       ...  ..   ...      ...       ...
5933556    KS   M  2017  Xzavier         5
5933557    KS   M  2017     Yael         5
5933558    KS   M  2017   Zaiden         5
5933559    KS   M  2017     Zayn         5
5933560    KS   M  2017     Zion         5

[5933561 rows x 5 columns]

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5933561 entries, 0 to 5933560
Data columns (total 5 columns):
 #   Column    Dtype
---  ------    -----
 0   state     object
 1   sex       object
 2   year      int64
 3   name      object
 4   quantity  int64
dtypes: int64(2), object(3)
memory usage: 226.3+ MB